#### Imports

In [4]:
import pandas as pd
import numpy as np

import pymysql
import sqlalchemy as alch
import os
from getpass import getpass

#### SQL Connection

In [7]:
password = getpass()
dbName = "linkedin"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = alch.create_engine(connectionData)

#### Import csv to SQL

In [9]:
linkedin_sql = pd.read_csv('../data/linkedin_salaries_sql.csv')
linkedin_sql.to_sql("linkedin", if_exists="append", con=engine, index=False)

491

#### Queries

    Relación de nivel de experiencia con remote_ratio

In [17]:
query = '''
    select experience_level, count(remote_ratio) count_remote from linkedin
    where remote_ratio = "En remoto" and experience_level is not null
    group by experience_level
    order by count_remote desc;
'''
res = pd.read_sql_query(query, engine)
res.sample(5)

          experience_level  count_remote
0               Intermedio           113
3                Prácticas             3
4                 Director             1
1          Sin experiencia            46
2  Algo de responsabilidad            35

In [13]:
query = '''
    select experience_level, count(remote_ratio) count_hibrid from linkedin
    where remote_ratio = "Híbrido" and experience_level is not null
    group by experience_level
    order by count_hibrid desc;
'''
res = pd.read_sql_query(query, engine)
res.sample(5)

          experience_level  count_hibrid
2                Prácticas            22
4  Algo de responsabilidad            10
1          Sin experiencia            30
3                 Director            13
0               Intermedio            88